name: “MobileNet”
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: true
    crop_size: 224
    mean_file: "data/ilsvrc12/imagenet_mean.binaryproto"
  }
  data_param {
    source: "examples/imagenet/ilsvrc12_train_lmdb"
    batch_size: 256
    backend: LMDB
  }
}
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
    crop_size: 224
    mean_file: "data/ilsvrc12/imagenet_mean.binaryproto"
  }
  data_param {
    source: "examples/imagenet/ilsvrc12_val_lmdb"
    batch_size: 50
    backend: LMDB
  }
}





layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "norm1"
  type: "LRN"
  bottom: "conv1"
  top: "norm1"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: “norm1”
  top: "conv1"
}








layer {
  name: "conv2-depthwise”
  type: "Convolution"
  bottom: "relu1"
  top: "conv2-depthwise"
  param {
    lr_mult: 1
    decay_mult: 1
    block_group_lasso {
        xdimen: 9
        ydimen: 32
        block_decay_mult: 1.0
    }
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 3
    stride: 1
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "norm2-depthwise"
  type: "LRN"
  bottom: "conv2-depthwise"
  top: "norm2-depthwise"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "relu2-depthwise"
  type: "ReLU"
  bottom: “norm2-depthwise"
  top: "conv2-depthwise"
}




layer {
  name: "conv2-pointwise”
  type: "Convolution"
  bottom: "relu2-depthwise”
  top: "conv2-pointwise"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "norm2-pointwise”
  type: "LRN"
  bottom: "conv2-pointwise"
  top: "norm2-pointwise”
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "relu2-pointwise”
  type: "ReLU"
  bottom: "conv2-pointwise"
  top: "conv3-pointwise"
}



여기부터다시..
탑과 바텀 찾아보고 다시..





layer {
  name: "conv3-depthwise”
  type: "Convolution"
  bottom: "relu2-pointwise”
  top: "conv3-depthwise"
  param {
    lr_mult: 1
    decay_mult: 1
    block_group_lasso {
        xdimen: 9
        ydimen: 64
        block_decay_mult: 1.0
    }
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    stride: 2
    kernel_size: 3
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "norm3-depthwise”
  type: "LRN"
  bottom: "conv3-depthwise"
  top: "norm3”
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "relu3-depthwise”
  type: "ReLU"
  bottom: "conv3-depthwise"
  top: "conv3-depthwise"
}

layer {
  name: "conv3-pointwise”
  type: "Convolution"
  bottom: "relu2"
  top: "conv4-pointwise"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "norm3-pointwise”
  type: "LRN"
  bottom: "conv3-pointwise"
  top: "norm3-pointwise”
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "relu3-pointwise”
  type: "ReLU"
  bottom: "conv3-pointwise"
  top: "conv3-pointwise"
}




layer {
  name: "conv4-depthwise”
  type: "Convolution"
  bottom: "relu3-pointwise”
  top: "conv4-depthwise"
  param {
    lr_mult: 1
    decay_mult: 1
    block_group_lasso {
        xdimen: 9
        ydimen: 128
        block_decay_mult: 1.0
    }
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 3
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "norm4-depthwise”
  type: "LRN"
  bottom: "conv4-depthwise"
  top: "norm4”
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "relu4-depthwise”
  type: "ReLU"
  bottom: "conv4-depthwise"
  top: "conv4-depthwise"
}

layer {
  name: "conv4-pointwise”
  type: "Convolution"
  bottom: "relu2"
  top: "conv4-pointwise"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "norm4-pointwise”
  type: "LRN"
  bottom: "conv4-pointwise"
  top: "norm4-pointwise”
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "relu4-pointwise”
  type: "ReLU"
  bottom: "conv4-pointwise"
  top: "conv4-pointwise"
}










layer {
  name: "conv5-depthwise”
  type: "Convolution"
  bottom: "relu4-pointwise”
  top: "conv5-depthwise"
  param {
    lr_mult: 1
    decay_mult: 1
    block_group_lasso {
        xdimen: 9
        ydimen: 64
        block_decay_mult: 1.0
    }
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    stride: 2
    kernel_size: 3
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "norm5-depthwise”
  type: "LRN"
  bottom: "conv5-depthwise"
  top: "norm5”
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "relu5-depthwise”
  type: "ReLU"
  bottom: "conv5-depthwise"
  top: "conv5-depthwise"
}

layer {
  name: "conv5-pointwise”
  type: "Convolution"
  bottom: "relu5”
  top: "conv5-pointwise"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "norm5-pointwise”
  type: "LRN"
  bottom: "conv5-pointwise"
  top: "norm5-pointwise”
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "relu5-pointwise”
  type: "ReLU"
  bottom: "conv5-pointwise"
  top: "conv5-pointwise"
}










layer {
  name: "conv6-depthwise”
  type: "Convolution"
  bottom: "relu5-pointwise”
  top: "conv6-depthwise"
  param {
    lr_mult: 1
    decay_mult: 1
    block_group_lasso {
        xdimen: 9
        ydimen: 256
        block_decay_mult: 1.0
    }
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 0
    stride: 1
    kernel_size: 3
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "norm5-depthwise”
  type: "LRN"
  bottom: "conv5-depthwise"
  top: "norm5”
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "relu5-depthwise”
  type: "ReLU"
  bottom: "conv5-depthwise"
  top: "conv5-depthwise"
}

layer {
  name: "conv5-pointwise”
  type: "Convolution"
  bottom: "relu5”
  top: "conv5-pointwise"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "norm5-pointwise”
  type: "LRN"
  bottom: "conv5-pointwise"
  top: "norm5-pointwise”
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "relu5-pointwise”
  type: "ReLU"
  bottom: "conv5-pointwise"
  top: "conv5-pointwise"
}










layer {
  name: "fc7"
  type: "InnerProduct"
  bottom: "fc6"
  top: "fc7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "relu7"
  type: "ReLU"
  bottom: "fc7"
  top: "fc7"
}
layer {
  name: "drop7"
  type: "Dropout"
  bottom: "fc7"
  top: "fc7"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc8"
  type: "InnerProduct"
  bottom: "fc7"
  top: "fc8"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1000
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "accuracy"
  type: "Accuracy"
  bottom: "fc8"
  bottom: "label"
  top: "accuracy"
  include {
    phase: TEST
  }
}
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "fc8"
  bottom: "label"
  top: "loss"
}